In [4]:
import pandas as pd
import numpy as np

In [3]:
path = "data/submission/"

lgbm = pd.read_csv(path + "submission_lgbm_noclip.csv")
xgb = pd.read_csv(path + "submission_xgb_noclip.csv")
xgb_clip = pd.read_csv(path + "submission_xgb_final.csv")

In [11]:
lgbm.head()

   num_date_time       answer
0  1_20220825 00  1919.713986
1  1_20220825 01  1876.780704
2  1_20220825 02  1876.780704
3  1_20220825 03  1855.942331
4  1_20220825 04  1855.942331

In [12]:
xgb.head()

   num_date_time       answer
0  1_20220825 00  2017.027710
1  1_20220825 01  1984.335449
2  1_20220825 02  1759.275757
3  1_20220825 03  1610.692749
4  1_20220825 04  1536.803345

In [10]:
xgb_clip.head()

   num_date_time       answer
0  1_20220825 00  2013.807373
1  1_20220825 01  1846.052734
2  1_20220825 02  1704.100586
3  1_20220825 03  1673.428345
4  1_20220825 04  1538.880000

In [16]:
submission = pd.read_csv("data/sample_submission.csv")
submission['answer'] = np.mean([lgbm.answer, xgb.answer, xgb_clip.answer], axis=0)
submission.to_csv(path + "submission_lgbm+xgb+xgb_clip.csv", index=False)
submission.head()

   num_date_time       answer
0  1_20220825 00  1983.516356
1  1_20220825 01  1902.389629
2  1_20220825 02  1780.052349
3  1_20220825 03  1713.354475
4  1_20220825 04  1643.875225